In [1]:
import numpy as np
import pandas as pd
print('done')

done

In [4]:
x = pd.Series([10,20,30,40,50])
print(x)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [11]:
x.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
x.values

array([10, 20, 30, 40, 50], dtype=int64)

In [12]:
x.dtype

dtype('int64')

In [14]:
data = [450,650,870]
Sales = pd.Series(data, index = ['Bob','Sally','Don'])
Sales

Bob      450
Sally    650
Don      870
dtype: int64

In [15]:
Sales.index

Index(['Bob', 'Sally', 'Don'], dtype='object')

In [16]:
Sales['Bob']

450

In [17]:
Sales[0] # positional index, same as Sales['Bob'] !

450

In [19]:
x[4]

50

In [20]:
Sales > 500

Bob      False
Sally     True
Don       True
dtype: bool

In [21]:
Sales[Sales > 500]

Sally    650
Don      870
dtype: int64

In [22]:
print('Don' in Sales, 650 in Sales) # 'in' uses index, NOT value!

True False

In [23]:
sales_dict = Sales.to_dict()
# easy to reformat Pandas series as standard Python dictionary!
print(sales_dict)

{'Bob': 450, 'Sally': 650, 'Don': 870}

In [24]:
sales_series = pd.Series(sales_dict)
# just as easy to do the reverse! 
sales_series

Bob      450
Sally    650
Don      870
dtype: int64

In [25]:
new_sales = pd.Series(Sales, index = ['Don', 'Sally', 'Lucy', 'Mike', 'Bob'])
new_sales

Don      870.0
Sally    650.0
Lucy       NaN
Mike       NaN
Bob      450.0
dtype: float64

In [28]:
np.isnan(new_sales) # numpy nan/null checker

Don      False
Sally    False
Lucy      True
Mike      True
Bob      False
dtype: bool

In [29]:
pd.isnull(new_sales) # pandas nan/null checker

Don      False
Sally    False
Lucy      True
Mike      True
Bob      False
dtype: bool

In [32]:
new_sales.index.name = 'Salesperson'
new_sales

Salesperson
Don      870.0
Sally    650.0
Lucy       NaN
Mike       NaN
Bob      450.0
dtype: float64

In [34]:
new_sales.name = 'Total Sales'
new_sales

Salesperson
Don      870.0
Sally    650.0
Lucy       NaN
Mike       NaN
Bob      450.0
Name: Total Sales, dtype: float64

In [32]:
# Dataframes in pandas
data = [['Don',870],['Sally',678],['Bob',4756]]
df = pd.DataFrame(data, columns=['Name','Sales'])
df

    Name  Sales
0    Don    870
1  Sally    678
2    Bob   4756

In [18]:
df_dict = pd.DataFrame(sales_dict, index=[1])
df_dict

NameError: name 'sales_dict' is not defined

In [19]:
sales_dict

NameError: name 'sales_dict' is not defined

In [41]:
dict_list = [{'Name':'Tom','Sales':250},{'Name':'Jane','Sales':300},{'Name':'Steve','Sales':350}
,{'Name':'Lucy','Sales':400}]

df_dict_list = pd.DataFrame(dict_list)
df_dict_list

    Name  Sales
0    Tom    250
1   Jane    300
2  Steve    350
3   Lucy    400

In [45]:
east = pd.Series([1000,1200,3400],index=['Q1','Q2','Q3'])
west = pd.Series([1100,1300,2400,3500],index=['Q1','Q2','Q3','Q4'])

df_region = pd.DataFrame({'East':east,'West':west})
df_region

      East  West
Q1  1000.0  1100
Q2  1200.0  1300
Q3  3400.0  2400
Q4     NaN  3500

In [47]:
years = ['2015','2016','2017','2018']
df_region['Years'] = years
df_region

      East  West Years
Q1  1000.0  1100  2015
Q2  1200.0  1300  2016
Q3  3400.0  2400  2017
Q4     NaN  3500  2018

In [48]:
df_region = df_region.set_index('Years')
df_region

         East  West
Years
2015   1000.0  1100
2016   1200.0  1300
2017   3400.0  2400
2018      NaN  3500

In [53]:
new_df = df_region.reindex(['2014','2015','2016','2017','2018','2019','2020'])
new_df

         East    West
Years
2014      NaN     NaN
2015   1000.0  1100.0
2016   1200.0  1300.0
2017   3400.0  2400.0
2018      NaN  3500.0
2019      NaN     NaN
2020      NaN     NaN

In [54]:
new_df = new_df.reindex(columns=['East','South','West'])
new_df

         East  South    West
Years
2014      NaN    NaN     NaN
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2018      NaN    NaN  3500.0
2019      NaN    NaN     NaN
2020      NaN    NaN     NaN

In [56]:
new_df.fillna(method='ffill') # front fill

         East  South    West
Years
2014      NaN    NaN     NaN
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2018   3400.0    NaN  3500.0
2019   3400.0    NaN  3500.0
2020   3400.0    NaN  3500.0

In [57]:
new_df.fillna(method='bfill') # back fill

         East  South    West
Years
2014   1000.0    NaN  1100.0
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2018      NaN    NaN  3500.0
2019      NaN    NaN     NaN
2020      NaN    NaN     NaN

In [60]:
new_df.interpolate() # interpolation - doesn't really work here because no column nan gaps

         East  South    West
Years
2014      NaN    NaN     NaN
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2018   3400.0    NaN  3500.0
2019   3400.0    NaN  3500.0
2020   3400.0    NaN  3500.0

In [64]:
new_df

         East  South    West
Years
2014      NaN    NaN     NaN
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2018      NaN    NaN  3500.0
2019      NaN    NaN     NaN
2020      NaN    NaN     NaN

In [76]:
new_df.dropna(axis=0, how='all') # dropping NaN-related entries
# axis=0: rows, axis=1: column
# how='all': all points along axis must be nan for drop
# how='all': any point along axis may be nan for drop

         East  South    West
Years
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2018      NaN    NaN  3500.0

In [77]:
new_df.dropna(axis=0, thresh=1)
# 'thresh=' set number of nans required to drop

         East  South    West
Years
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2018      NaN    NaN  3500.0

In [78]:
new_df['East'] # 1-dimensional -> is now a SERIES!

Years
2014       NaN
2015    1000.0
2016    1200.0
2017    3400.0
2018       NaN
2019       NaN
2020       NaN
Name: East, dtype: float64

In [81]:
new_df.iloc[1:3] # location by index number input

         East  South    West
Years
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0

In [82]:
new_df.loc[['2016','2019']] # location by index value input

         East  South    West
Years
2016   1200.0    NaN  1300.0
2019      NaN    NaN     NaN

In [86]:
new_df.sort_index(ascending=False)

         East  South    West
Years
2020      NaN    NaN     NaN
2019      NaN    NaN     NaN
2018      NaN    NaN  3500.0
2017   3400.0    NaN  2400.0
2016   1200.0    NaN  1300.0
2015   1000.0    NaN  1100.0
2014      NaN    NaN     NaN

In [89]:
new_df.sort_values(by='East')

         East  South    West
Years
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2014      NaN    NaN     NaN
2018      NaN    NaN  3500.0
2019      NaN    NaN     NaN
2020      NaN    NaN     NaN

In [90]:
new_df.sort_values(by=['East','West'])

         East  South    West
Years
2015   1000.0    NaN  1100.0
2016   1200.0    NaN  1300.0
2017   3400.0    NaN  2400.0
2018      NaN    NaN  3500.0
2014      NaN    NaN     NaN
2019      NaN    NaN     NaN
2020      NaN    NaN     NaN

In [145]:
# GROUP TASK
# look at pandas read_csv for iris.csv
# put this into dataframe
# look at pandas' group by method (split by column)
# use .head method -> show first few rows of dataframe
# .describe on iris AND grouped-by iris

iris_df = pd.read_csv('iris.csv')
iris_df.describe()
#print(iris_df.head())
#print(iris_df.tail())

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [146]:
iris_df.groupby(by='species',axis=0).mean().describe()

       sepal_length  sepal_width  petal_length  petal_width
count      3.000000     3.000000      3.000000     3.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.795061     0.331325      2.089602     0.897798
min        5.006000     2.770000      1.464000     0.244000
25%        5.471000     2.872000      2.862000     0.785000
50%        5.936000     2.974000      4.260000     1.326000
75%        6.262000     3.196000      4.906000     1.676000
max        6.588000     3.418000      5.552000     2.026000

In [147]:
iris_df['petal_rank'] = iris_df['petal_length'].rank(ascending=True,method='min')
print(iris_df.sort_values(by='petal_rank').head(10))

    sepal_length  sepal_width  petal_length  petal_width species  petal_rank
22           4.6          3.6           1.0          0.2  setosa         1.0
13           4.3          3.0           1.1          0.1  setosa         2.0
14           5.8          4.0           1.2          0.2  setosa         3.0
35           5.0          3.2           1.2          0.2  setosa         3.0
36           5.5          3.5           1.3          0.2  setosa         5.0
40           5.0          3.5           1.3          0.3  setosa         5.0
38           4.4          3.0           1.3          0.2  setosa         5.0
42           4.4          3.2           1.3          0.2  setosa         5.0
2            4.7          3.2           1.3          0.2  setosa         5.0
41           4.5          2.3           1.3          0.3  setosa         5.0

In [148]:
iris_df.groupby('species').mean()

            sepal_length  sepal_width  petal_length  petal_width  petal_rank
species
setosa             5.006        3.418         1.464        0.244       21.36
versicolor         5.936        2.770         4.260        1.326       74.78
virginica          6.588        2.974         5.552        2.026      123.12

In [149]:
iris_df['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [168]:
iris_df_setosa = iris_df[iris_df['species']=='setosa'].reset_index(drop=True)
iris_df_versicolor = iris_df[iris_df['species']=='versicolor'].reset_index(drop=True)
iris_df_virginica = iris_df[iris_df['species']=='virginica'].reset_index(drop=True)
print(iris_df_setosa['sepal_length'].head())
print(iris_df_versicolor['sepal_length'].head())
print(iris_df_virginica['sepal_length'].head())

0    5.1
1    4.9
2    4.7
3    4.6
4    5.0
Name: sepal_length, dtype: float64
0    7.0
1    6.4
2    6.9
3    5.5
4    6.5
Name: sepal_length, dtype: float64
0    6.3
1    5.8
2    7.1
3    6.3
4    6.5
Name: sepal_length, dtype: float64

In [176]:
iris_df_sepal = iris_df[['sepal_length','sepal_width','species','petal_rank']]
print(iris_df_sepal.head())
iris_df_petal = iris_df[['petal_length','petal_width','species','petal_rank']]
print(iris_df_petal.head())

   sepal_length  sepal_width species  petal_rank
0           5.1          3.5  setosa        12.0
1           4.9          3.0  setosa        12.0
2           4.7          3.2  setosa         5.0
3           4.6          3.1  setosa        24.0
4           5.0          3.6  setosa        12.0
   petal_length  petal_width species  petal_rank
0           1.4          0.2  setosa        12.0
1           1.4          0.2  setosa        12.0
2           1.3          0.2  setosa         5.0
3           1.5          0.2  setosa        24.0
4           1.4          0.2  setosa        12.0

In [177]:
# look up merge and concat pt 1

# merge the sepal and petal information
cols_to_use = iris_df_petal.columns.difference(iris_df_sepal.columns)
pd.merge(iris_df_sepal,iris_df_petal[cols_to_use],how='inner',left_index=True,right_index=True)

,sepal_length,sepal_width,species,petal_rank,petal_length,petal_width
0,5.1,3.5,setosa,12.0,1.4,0.2
1,4.9,3.0,setosa,12.0,1.4,0.2
2,4.7,3.2,setosa,5.0,1.3,0.2
3,4.6,3.1,setosa,24.0,1.5,0.2
4,5.0,3.6,setosa,12.0,1.4,0.2
...,...,...,...,...,...,...
145,6.7,3.0,virginica,117.0,5.2,2.3
146,6.3,2.5,virginica,105.0,5.0,1.9
147,6.5,3.0,virginica,117.0,5.2,2.0
148,6.2,3.4,virginica,121.0,5.4,2.3
149,5.9,3.0,virginica,109.0,5.1,1.8

In [175]:
# look up merge and concat pt 2

# concat joining the species
pd.concat([iris_df_setosa,iris_df_versicolor,iris_df_virginica],ignore_index=True)

,sepal_length,sepal_width,petal_length,petal_width,species,petal_rank
0,5.1,3.5,1.4,0.2,setosa,12.0
1,4.9,3.0,1.4,0.2,setosa,12.0
2,4.7,3.2,1.3,0.2,setosa,5.0
3,4.6,3.1,1.5,0.2,setosa,24.0
4,5.0,3.6,1.4,0.2,setosa,12.0
...,...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,virginica,117.0
146,6.3,2.5,5.0,1.9,virginica,105.0
147,6.5,3.0,5.2,2.0,virginica,117.0
148,6.2,3.4,5.4,2.3,virginica,121.0
149,5.9,3.0,5.1,1.8,virginica,109.0